In [6]:
import numpy as np
import pandas as pd# importing panda and numpy file

In [7]:
d=np.random.randn(5,4)#create a random matrix of 5*4

In [8]:
pd.DataFrame(d) #so create excel sheet of 4*5matrix with f=default column and index value

          0         1         2         3
0 -1.045745 -3.255312  1.189019  1.101743
1 -0.214986  0.665419  0.383045  0.539665
2 -1.232574 -1.122076 -0.751143 -0.918360
3 -1.788104 -0.038356 -0.978313  0.330927
4  1.030100 -0.493378  0.054255  0.386318

In [13]:
df=pd.DataFrame(d,index=['A','B','C','D','E'],columns=['W','X','Y','Z'])#to define own index and column so define in this way
df

          W         X         Y         Z
A -1.045745 -3.255312  1.189019  1.101743
B -0.214986  0.665419  0.383045  0.539665
C -1.232574 -1.122076 -0.751143 -0.918360
D -1.788104 -0.038356 -0.978313  0.330927
E  1.030100 -0.493378  0.054255  0.386318

In [14]:
# slicing and indexing in panadas
#when need slicing of one column
df['W']

A   -1.045745
B   -0.214986
C   -1.232574
D   -1.788104
E    1.030100
Name: W, dtype: float64

In [15]:
#when two column slicing needed then two squarebrackets or to select a column
df[['W','X']]

          W         X
A -1.045745 -3.255312
B -0.214986  0.665419
C -1.232574 -1.122076
D -1.788104 -0.038356
E  1.030100 -0.493378

In [16]:
#define a new column by addaing te=wo column
df['newcol']=df['W']+df['X']
df

          W         X         Y         Z    newcol
A -1.045745 -3.255312  1.189019  1.101743 -4.301058
B -0.214986  0.665419  0.383045  0.539665  0.450433
C -1.232574 -1.122076 -0.751143 -0.918360 -2.354650
D -1.788104 -0.038356 -0.978313  0.330927 -1.826460
E  1.030100 -0.493378  0.054255  0.386318  0.536722

In [17]:
# for delete a column we use drop
df.drop('W',axis=1)#here it delete column along Y- axis

          X         Y         Z    newcol
A -3.255312  1.189019  1.101743 -4.301058
B  0.665419  0.383045  0.539665  0.450433
C -1.122076 -0.751143 -0.918360 -2.354650
D -0.038356 -0.978313  0.330927 -1.826460
E -0.493378  0.054255  0.386318  0.536722

In [20]:
df.drop('A',axis=0)#here delete row along X-axis

          W         X         Y         Z    newcol
B -0.214986  0.665419  0.383045  0.539665  0.450433
C -1.232574 -1.122076 -0.751143 -0.918360 -2.354650
D -1.788104 -0.038356 -0.978313  0.330927 -1.826460
E  1.030100 -0.493378  0.054255  0.386318  0.536722

In [22]:
df#sodelete from memory and not permanently

          W         X         Y         Z    newcol
A -1.045745 -3.255312  1.189019  1.101743 -4.301058
B -0.214986  0.665419  0.383045  0.539665  0.450433
C -1.232574 -1.122076 -0.751143 -0.918360 -2.354650
D -1.788104 -0.038356 -0.978313  0.330927 -1.826460
E  1.030100 -0.493378  0.054255  0.386318  0.536722

In [24]:
#to delete permanenetly
df.drop('W',axis=1,inplace=True)

In [25]:
df

          X         Y         Z    newcol
A -3.255312  1.189019  1.101743 -4.301058
B  0.665419  0.383045  0.539665  0.450433
C -1.122076 -0.751143 -0.918360 -2.354650
D -0.038356 -0.978313  0.330927 -1.826460
E -0.493378  0.054255  0.386318  0.536722

In [26]:
# to select a row we use loc and iloc
df[df>0]

          X         Y         Z    newcol
A       NaN  1.189019  1.101743       NaN
B  0.665419  0.383045  0.539665  0.450433
C       NaN       NaN       NaN       NaN
D       NaN       NaN  0.330927       NaN
E       NaN  0.054255  0.386318  0.536722

In [27]:
df.loc['B']#when row name is given

X         0.665419
Y         0.383045
Z         0.539665
newcol    0.450433
Name: B, dtype: float64

In [28]:
df.iloc[2]#when no row name given and used using index so index=2 is 'B' index

X        -1.122076
Y        -0.751143
Z        -0.918360
newcol   -2.354650
Name: C, dtype: float64

In [29]:
#for checking condition df<0 then it give the result in form of boolean
df<0

       X      Y      Z  newcol
A   True  False  False    True
B  False  False  False   False
C   True   True   True    True
D   True   True  False    True
E   True  False  False   False

In [30]:
#but whhen we need the value exactly satisfies the cond. then we use indexing
df[df<1]

          X         Y         Z    newcol
A -3.255312       NaN       NaN -4.301058
B  0.665419  0.383045  0.539665  0.450433
C -1.122076 -0.751143 -0.918360 -2.354650
D -0.038356 -0.978313  0.330927 -1.826460
E -0.493378  0.054255  0.386318  0.536722

In [34]:
#group by  allows you to group the row of data together and call aggregate function
#creating a dictionary
import pandas as pd
data={'company':['WWE','WWF','HP','DELL','DELL','HP','MSI'],
      'person':['Sam','Curan','Manoti','Samurai', 'itachi','sasuke','Naruto'],
      'lar':[1,29,22002,29892,8890,2029,56]}

In [35]:
data

{'company': ['WWE', 'WWF', 'HP', 'DELL', 'DELL', 'HP', 'MSI'],
 'person': ['Sam', 'Curan', 'Manoti', 'Samurai', 'itachi', 'sasuke', 'Naruto'],
 'lar': [1, 29, 22002, 29892, 8890, 2029, 56]}

In [37]:
df=pd.DataFrame(data)

In [38]:
df

  company   person    lar
0     WWE      Sam      1
1     WWF    Curan     29
2      HP   Manoti  22002
3    DELL  Samurai  29892
4    DELL   itachi   8890
5      HP   sasuke   2029
6     MSI   Naruto     56

In [40]:
by_comp=df.groupby("company")

In [41]:
by=df.groupby("person")

In [42]:
by_comp

In [43]:
by_comp.mean()#mean by company

             lar
company
DELL     19391.0
HP       12015.5
MSI         56.0
WWE          1.0
WWF         29.0

In [44]:
by.mean()#mean by person names

           lar
person
Curan       29
Manoti   22002
Naruto      56
Sam          1
Samurai  29892
itachi    8890
sasuke    2029

In [45]:
df.groupby('company').mean()#can also find mean by this way of company

             lar
company
DELL     19391.0
HP       12015.5
MSI         56.0
WWE          1.0
WWF         29.0

In [46]:
by_comp.min()

          person   lar
company
DELL     Samurai  8890
HP        Manoti  2029
MSI       Naruto    56
WWE          Sam     1
WWF        Curan    29

In [47]:
by_comp.max()

         person    lar
company
DELL     itachi  29892
HP       sasuke  22002
MSI      Naruto     56
WWE         Sam      1
WWF       Curan     29

In [48]:
by_comp.std()

                  lar
company
DELL     14850.656618
HP       14123.043741
MSI               NaN
WWE               NaN
WWF               NaN

In [49]:
by_comp.count()

         person  lar
company
DELL          2    2
HP            2    2
MSI           1    1
WWE           1    1
WWF           1    1

In [53]:
data2={'Company':['GOOG','GOOG','IDF','IDF','FB','FB'],
       'Name':['Sam','Ram','Charlie','Amy','Carl','Sarah']
       ,'Sales':[200,120,340,124,243,350]
    
}

In [54]:
df2=pd.DataFrame(data2)
df2

  Company     Name  Sales
0    GOOG      Sam    200
1    GOOG      Ram    120
2     IDF  Charlie    340
3     IDF      Amy    124
4      FB     Carl    243
5      FB    Sarah    350

In [56]:
by_comp2=df2.groupby("Company")

In [57]:
by_comp2.mean()

         Sales
Company
FB       296.5
GOOG     160.0
IDF      232.0

In [58]:
df2.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
IDF      232.0

In [59]:
by_comp2.max()

            Name  Sales
Company
FB         Sarah    350
GOOG         Sam    200
IDF      Charlie    340

In [60]:
by_comp2.min()

         Name  Sales
Company
FB       Carl    243
GOOG      Ram    120
IDF       Amy    124

In [63]:
by_comp2.count()

         Name  Sales
Company
FB          2      2
GOOG        2      2
IDF         2      2

In [64]:
by_comp2.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
IDF      152.735065

In [65]:
by_comp2.sum()

         Sales
Company
FB         593
GOOG       320
IDF        464

In [66]:
data3={'Company':['GOOG','GOOG','IDF','IDF','FB','FB'],
       'Name':['Sam','Ram','Charlie','Amy','Carl','Sarah']
       ,'Sales':[200,120,340,124,243,350]
    
}

In [70]:
df3=pd.DataFrame(data3)

In [71]:
merg=pd.merge(df2,df3)

merg

In [72]:
merg

  Company     Name  Sales
0    GOOG      Sam    200
1    GOOG      Ram    120
2     IDF  Charlie    340
3     IDF      Amy    124
4      FB     Carl    243
5      FB    Sarah    350

In [76]:
#joining function
#df4=pd.DataFrame({'Init'})
joined=df.joined(df3)

AttributeError: 'DataFrame' object has no attribute 'joined'

In [88]:
df4=pd.DataFrame({'HPI':[80,90,60,70],
                 'Int_rate':[50,45,45,67],
                  'Int_GDP':[50,45,45,67],
                 'Index':[2001,2002,2003,2004]
                 })
df5=pd.DataFrame({'HPI':[80,90,60,70],
                 'Int_rate':[50,45,45,67],
                  'Int_GDP':[50,45,45,67],
                 'Index':[2005,2006,2007,2008]
                 })

In [86]:
joined=df4.join(df5)

ValueError: columns overlap but no suffix specified: Index(['HPI', 'Int_rate', 'Int_GDP', 'Index'], dtype='object')

In [ ]:
#concat